<a href="https://colab.research.google.com/github/junio-firmino/Aprendizado_python/blob/master/Multi_df.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
eng_url = "/content/drive/MyDrive/eng.csv"
state_url = "/content/drive/MyDrive/state.csv"
liberal_url= "/content/drive/MyDrive/liberal_arts.csv"
ivies_url = "/content/drive/MyDrive/ivies.csv"

In [ ]:
eng = pd.read_csv(eng_url)

In [ ]:
state = pd.read_csv(state_url)

In [ ]:
liberal = pd.read_csv(liberal_url)

In [ ]:
ivies = pd.read_csv(ivies_url)

In [ ]:
dfs = [eng,state,liberal,ivies]

In [ ]:
pd.concat(dfs)

                                     School Name  ... Mid-Career Median Salary
0    Massachusetts Institute of Technology (MIT)  ...             $126,000.00
1       California Institute of Technology (CIT)  ...             $123,000.00
2                            Harvey Mudd College  ...             $122,000.00
3   Polytechnic University of New York, Brooklyn  ...             $114,000.00
4                                   Cooper Union  ...             $114,000.00
..                                           ...  ...                      ...
3                             Harvard University  ...             $124,000.00
4                     University of Pennsylvania  ...             $120,000.00
5                             Cornell University  ...             $110,000.00
6                               Brown University  ...             $109,000.00
7                            Columbia University  ...             $107,000.00

[249 rows x 4 columns]

In [ ]:
set(eng['School Name']).difference(state['School Name'])

{'California Institute of Technology (CIT)',
 'Carnegie Mellon University (CMU)',
 'Colorado School of Mines',
 'Cooper Union',
 'Embry-Riddle Aeronautical University (ERAU)',
 'Georgia Institute of Technology',
 'Harvey Mudd College',
 'Illinois Institute of Technology (IIT)',
 'Massachusetts Institute of Technology (MIT)',
 'New Mexico Institute of Mining and Technology (New Mexico Tech)',
 'Polytechnic University of New York, Brooklyn',
 'Rensselaer Polytechnic Institute (RPI)',
 'Rochester Institute of Technology (RIT)',
 'South Dakota School of Mines & Technology',
 'Stevens Institute of Technology',
 'Tennessee Technological University',
 'Virginia Polytechnic Institute and State University (Virginia Tech)',
 'Wentworth Institute of Technology',
 'Worcester Polytechnic Institute (WPI)'}

In [ ]:
'Cooper Union' in ivies['School Name'].values

False

In [ ]:
schools = pd.concat(dfs).drop_duplicates(subset=['School Name'], keep='first')

In [ ]:
schools.loc[19]

              School Name  ... Mid-Career Median Salary
19     Rutgers University  ...              $91,800.00
19  Mount Holyoke College  ...              $94,100.00

[2 rows x 4 columns]

In [ ]:
schools_1 = schools.reset_index(drop=True)

In [ ]:
schools_1.duplicated().sum()

0

In [ ]:
schools_1

                                      School Name  ... Mid-Career Median Salary
0     Massachusetts Institute of Technology (MIT)  ...             $126,000.00
1        California Institute of Technology (CIT)  ...             $123,000.00
2                             Harvey Mudd College  ...             $122,000.00
3    Polytechnic University of New York, Brooklyn  ...             $114,000.00
4                                    Cooper Union  ...             $114,000.00
..                                            ...  ...                      ...
244                            Harvard University  ...             $124,000.00
245                    University of Pennsylvania  ...             $120,000.00
246                            Cornell University  ...             $110,000.00
247                              Brown University  ...             $109,000.00
248                           Columbia University  ...             $107,000.00

[249 rows x 4 columns]

In [ ]:
pd.concat(dfs, ignore_index=True).drop_duplicates(subset=['School Name'], keep='first')

                                      School Name  ... Mid-Career Median Salary
0     Massachusetts Institute of Technology (MIT)  ...             $126,000.00
1        California Institute of Technology (CIT)  ...             $123,000.00
2                             Harvey Mudd College  ...             $122,000.00
3    Polytechnic University of New York, Brooklyn  ...             $114,000.00
4                                    Cooper Union  ...             $114,000.00
..                                            ...  ...                      ...
244                            Harvard University  ...             $124,000.00
245                    University of Pennsylvania  ...             $120,000.00
246                            Cornell University  ...             $110,000.00
247                              Brown University  ...             $109,000.00
248                           Columbia University  ...             $107,000.00

[249 rows x 4 columns]

In [ ]:
ivies2 = ivies.set_index( 'School Name')

In [ ]:
eng2 = eng.set_index('School Name')

In [ ]:
pd.concat([ivies2,eng2], verify_integrity=True)

                                                    School Type  ... Mid-Career Median Salary
School Name                                                      ...
Dartmouth College                                    Ivy League  ...             $134,000.00
Princeton University                                 Ivy League  ...             $131,000.00
Yale University                                      Ivy League  ...             $126,000.00
Harvard University                                   Ivy League  ...             $124,000.00
University of Pennsylvania                           Ivy League  ...             $120,000.00
Cornell University                                   Ivy League  ...             $110,000.00
Brown University                                     Ivy League  ...             $109,000.00
Columbia University                                  Ivy League  ...             $107,000.00
Massachusetts Institute of Technology (MIT)         Engineering  ...             $126,000.00
California Institute of Technology (CIT)            Engineering  ...             $123,000.00
Harvey Mudd College                                 Engineering  ...             $122,000.00
Polytechnic University of New York, Brooklyn        Engineering  ...             $114,000.00
Cooper Union                                        Engineering  ...             $114,000.00
Worcester Polytechnic Institute (WPI)               Engineering  ...             $114,000.00
Carnegie Mellon University (CMU)                    Engineering  ...             $111,000.00
Rensselaer Polytechnic Institute (RPI)              Engineering  ...             $110,000.00
Georgia Institute of Technology                     Engineering  ...             $106,000.00
Colorado School of Mines                            Engineering  ...             $106,000.00
Stevens Institute of Technology                     Engineering  ...             $105,000.00
Illinois Institute of Technology (IIT)              Engineering  ...              $97,800.00
Wentworth Institute of Technology                   Engineering  ...              $96,700.00
Virginia Polytechnic Institute and State Univer...  Engineering  ...              $95,400.00
South Dakota School of Mines & Technology           Engineering  ...              $93,400.00
New Mexico Institute of Mining and Technology (...  Engineering  ...              $93,400.00
Rochester Institute of Technology (RIT)             Engineering  ...              $84,600.00
Embry-Riddle Aeronautical University (ERAU)         Engineering  ...              $80,700.00
Tennessee Technological University                  Engineering  ...              $80,000.00

[27 rows x 3 columns]

In [ ]:
school_name_index = pd.concat([ivies2,eng2])

In [ ]:
 random_rows = ivies2.sample()

In [ ]:
random_rows

                   School Type Starting Median Salary Mid-Career Median Salary
School Name
Harvard University  Ivy League            $63,400.00              $124,000.00

In [ ]:
eng3 = eng2.append(random_rows)

In [ ]:
concat_ivies2_eng3 = pd.concat([ivies2,eng3])

In [ ]:
concat_ivies2_eng3.duplicated()

School Name
Dartmouth College                                                      False
Princeton University                                                   False
Yale University                                                        False
Harvard University                                                     False
University of Pennsylvania                                             False
Cornell University                                                     False
Brown University                                                       False
Columbia University                                                    False
Massachusetts Institute of Technology (MIT)                            False
California Institute of Technology (CIT)                               False
Harvey Mudd College                                                    False
Polytechnic University of New York, Brooklyn                           False
Cooper Union                                                           False
Worcester Polytechnic Institute (WPI)                                  False
Carnegie Mellon University (CMU)                                       False
Rensselaer Polytechnic Institute (RPI)                                 False
Georgia Institute of Technology                                        False
Colorado School of Mines                                               False
Stevens Institute of Technology                                        False
Illinois Institute of Technology (IIT)                                 False
Wentworth Institute of Technology                                      False
Virginia Polytechnic Institute and State University (Virginia Tech)    False
South Dakota School of Mines & Technology                              False
New Mexico Institute of Mining and Technology (New Mexico Tech)        False
Rochester Institute of Technology (RIT)                                False
Embry-Riddle Aeronautical University (ERAU)                            False
Tennessee Technological University                                     False
Harvard University                                                      True
dtype: bool

In [ ]:
dfc = pd.concat([liberal,state])

In [ ]:
dfc.head()

           School Name  ... Mid-Career Median Salary
0  Bucknell University  ...             $110,000.00
1   Colgate University  ...             $108,000.00
2      Amherst College  ...             $107,000.00
3    Lafayette College  ...             $107,000.00
4      Bowdoin College  ...             $107,000.00

[5 rows x 4 columns]

In [ ]:
 dfc.nunique()

School Name                 222
School Type                   2
Starting Median Salary      122
Mid-Career Median Salary    155
dtype: int64

In [ ]:
dfc.iloc[:,3].replace('\$|,','',regex=True).astype(float).mean()

80856.3063063063

In [ ]:
liberal2 = liberal.sort_values(by=['Mid-Career Median Salary'],ascending=False).iloc[:3].reset_index(drop=True)

In [ ]:
state2 = state.sort_values(by=['Mid-Career Median Salary'],ascending=False).iloc[:3].reset_index(drop=True)

In [ ]:
pd.concat([liberal2,state2],axis=1, keys=['Liberal Arts','State'],sort=False)

                                    Liberal Arts  ...                    State
                                     School Name  ... Mid-Career Median Salary
0  Wesleyan University (Middletown, Connecticut)  ...              $99,600.00
1                                  Bates College  ...              $97,600.00
2                                  Union College  ...              $96,700.00

[3 rows x 8 columns]